// This file is the descriptor for the Custom code recipe create-if-else-loop
{
    // Meta data for display purposes
    "meta": {
        // label: name of the recipe as displayed, should be short
        "label": "Create Loop",
        // description: longer string to help end users understand what this recipe does
        "description": "Creates a loop in your flow. Uses the input dataset the first time, and then updates the output with the final dataset in the flow each loop.",
        // icon: must be one of the FontAwesome 3.2.1 icons, complete list here at https://fontawesome.com/v3.2.1/icons/
        "icon": "icon-retweet"
    },

    "kind": "PYTHON",
    "selectableFromDataset": "starter_dataset",

    // Inputs and outputs are defined by roles. In the recipe's I/O tab, the user can associate one
    // or more dataset to each input and output role.

    // The "arity" field indicates whether the user can associate several datasets to the role ('NARY')
    // or at most one ('UNARY'). The "required" field indicates whether the user is allowed to
    // associate no dataset with the role.

    "inputRoles": [
        {
            "name": "starter_dataset",
            "label": "Initial Dataset in Loop",
            "description": "This dataset should be the starting dataset which will create an output dataset that will be iteratively updated each loop.",
            "arity": "UNARY",
            "required": true,
            "acceptsDataset": true
        }
    ],

    "outputRoles": [
        {
            "name": "iterated_dataset",
            "label": "Dataset that is the input for each new iteration",
            "description": "This dataset will be updated every loop, and is a copy of the output dataset of your loop.",
            "arity": "UNARY",
            "required": true,
            "acceptsDataset": true
        }
    ],

    /* The field "params" holds a list of all the params
       for wich the user will be prompted for values in the Settings tab of the recipe.

       The available parameter types include:
       STRING, STRINGS, INT, DOUBLE, BOOLEAN, SELECT, MULTISELECT, MAP, TEXTAREA, PRESET, COLUMN, COLUMNS

       For the full list and for more details, see the documentation: https://doc.dataiku.com/dss/latest/plugins/reference/params.html
    */

    "params": [
        {
          "type": "DATASET",
          "name": "final_dataset",
          "label": "This dataset will be written back to your output dataset of this plugin each loop"
        }
    ],

    // The field "resourceKeys" holds a list of keys that allows to limit the number
    // of concurrent executions and activities triggered by this recipe.
    //
    // Administrators can configure the limit per resource key in the Administration > Settings > Flow build
    // screen.

    "resourceKeys": []

}
